{
  "rentalAlsoLike": [
    {
      "name": "Hour Electric Boat",
      "alias": "Electric Boat Rental",
      "url": "https://lakelasvegaswatersports.com/2-hour-electric-boat-rental/",
      "caption": "2-Hour Rental | From: <span>$199</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2021/08/Hnet.com_image__4__lg.jpg"
    },
    {
      "name": "Paddleboard Rentals",
      "url": "https://lakelasvegaswatersports.com/paddleboard-rentals/",
      "caption": "1-Hour Rental | From: <span>$40</span><br/>2-Hour Rental | From: <span>$60</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2020/02/paddleboard-main.jpg"
    },
    {
      "name": "Pink Electric Boat Rental",
      "url": "https://lakelasvegaswatersports.com/pink-electric-boat-rental-at-lake-las-vegas/",
      "caption": "3-Hour Rental | From: <span>$449</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/06/pink-boat.jpg"
    },
    {
      "name": "Kayak Rentals",
      "url": "https://lakelasvegaswatersports.com/kayak-rentals/",
      "caption": "1-Hour Rental | From: <span>$40</span><br/>2-Hour Rental | From: <span>$60</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2020/02/kayak-main.jpg"
    },
    {
      "name": "Cable Park",
      "url": "https://lakelasvegaswatersports.com/cable-park/",
      "caption": "30-Minute Pass | From: <span>$60</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2020/02/cablepark-main.jpg"
    },
    {
      "name": "Flyboard Experience",
      "url": "https://lakelasvegaswatersports.com/flyboard-water-jetpack/",
      "caption": "30-Minute Experience | From: <span>$99</span>",
      "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2022/10/772A3296-3-1-1.jpg"
    }
  ],
  "rental": [
    {
      "name": "Hour Electric Boat",
      "caption": "No Licence Needed, size Regular 9 guests or XL 12 guests",
      "images": [
        "https://drive.google.com/file/d/1yYnV-ZYT75-ezC0HvemU6JoB-hltHDYZ/view?usp=sharing",
        "https://drive.google.com/file/d/1ee1Dm8OqJ8BrmjOZALr9TJn8fUTIubIi/view?usp=sharing",
        "https://drive.google.com/file/d/1BeZysA-ormzZZ6gZS_moNFn1zZv12cDW/view?usp=sharing",
        "https://drive.google.com/file/d/1oUWZ6qhmdSgO0IiSZvsAUAwV0CKZhtI2/view?usp=sharing",
        "https://drive.google.com/file/d/1NycjPFv7s_oUtrLUNi2Id4fTCy1IVSNt/view?usp=sharing",
        "https://drive.google.com/file/d/1kT9GKfa6dSl9PrIZQ2FtB7tblI4MYPTh/view?usp=sharing",
        "https://drive.google.com/file/d/1Zb-on24s8unnUH6VNPvjzIj-6QMjYO7L/view?usp=sharing"
      ],
      "reviews": [
        {
          "type": "tripadvisor",
          "name": "beth863",
          "text": "We love going out on our own rental boat out on Lake Las Vegas. It's a must every year which is why we buy the annual pass. Very relaxing!"
        },
        {
          "type": "tripadvisor",
          "name": "brendaparsee",
          "text": "We had a wonderful time two hours me and my family for my husband’s birthday we took the boat out enjoy the boat ride fo\nI want to think though employees that was there they all had a way I had a wonderful time my husband my family had a wonderful time and he was very helpful and they was very knowledgeable about everything he was telling us and we had a great boat ride and a great time so thanks to everybody that was dissipating in our excitement we appreciate yeah"
        },
        {
          "type": "tripadvisor",
          "name": "makennastewart99",
          "text": "From the moment we checked in to getting on the boat everyone was very friendly and informative. Huge thank you to an awesome team for a great experience, this was the best idea for my birthday and I will definetely be recommending Lake Las Vegas Water sports to friends and family for all events! Thank you guys!!"
        },
        {
          "type": "tripadvisor",
          "name": "walke122",
          "text": "My wife and I enjoyed the electric boat cruising around the lake. The temperature of the lake and the scenery around it made the moment even better. I'm looking forward to doing it again."
        },
        {
          "type": "tripadvisor",
          "name": "exysag1969",
          "text": "We rented the electric boat. There were 7 of us. The boat had Bluetooth and we had the music. My Brother drove the boat and the party began. You can bring your own food and liquor++++++ the scene is amazing, so surreal and calm. We did the 90 minute yacht the first time, but this is the way to go. My only complaint was we wish we could’ve rented for 4 hrs instead of 2. Time flies when you’re having fun!!!!!"
        },
        {
          "type": "tripadvisor",
          "name": "donnaoteri",
          "text": "We rented a boat at Lake Las Vegas for the first time….but, it won’t be our last!!! What a great afternoon for adults & kids! The Lake Las Vegas Water Sports experience was first class - boats are clean and well maintained, staff is efficient & professional and check-in seamless. I highly recommend this water activity on beautiful Lake Las Vegas!"
        },
        {
          "type": "yelp",
          "name": "Rachel G.",
          "text": "My family and I thoroughly enjoyed our electric boat ride! Lake Las Vegas Water Sports has an option to rent an electric boat for 2 hours. We booked the boat on their website, and the waivers for each person were emailed to us, making our booking and check in experience very easy and seamless. The staff is extremely friendly and they took their time in explaining anything we needed to know. We will not hesitate to go back on our next trip for more water fun!"
        },
        {
          "type": "yelp",
          "name": "Linda P.",
          "text": "The boat ride was gifted to us for Mother's Day. Our boat rental went very well. The process was smooth and the attendants were very caring and helpful. My husband and I are handicapped and the attendants were very accommodating. The boat was great and the scenery was spectacular! We had an enjoyable time and felt very blessed!"
        }
      ]
    },
    {
      "name": "Paddleboard",
      "caption": "1 or 2 Hours",
      "images": [
        "https://drive.google.com/file/d/1YDlCNhju-wuAoRg1GZbJk6jwLGpQBjz3/view?usp=sharing",
        "https://drive.google.com/file/d/1-gtwWonWA9jfFFMmvzmC2aP7kdZyWvXe/view?usp=sharing",
        "https://drive.google.com/file/d/1zgf6H5zpW3eNTq9-KoYM18qiy1n5bEuZ/view?usp=sharing",
        "https://drive.google.com/file/d/1mifwGe954Y1nvxlm6JG9dm9yaAJ0BPbU/view?usp=sharing",
        "https://drive.google.com/file/d/1D7rHwA30iOLBZ-KLkprULe5fZIuTDa2V/view?usp=sharing",
        "https://drive.google.com/file/d/1lRxzMVXlvw1ZLaiGN1OnyzUdRzGwOa0B/view?usp=sharing",
        "https://drive.google.com/file/d/1tX87qSle8kM0FoKY-NaoNy4L2_HFObJf/view?usp=sharing ",
        "https://drive.google.com/file/d/1wTVfAO8HwEjZz-EAQ7nfqIRKFJ_p2bmk/view?usp=sharing",
        "https://drive.google.com/file/d/1sa3CeQjt-GOBQ_abGrp2zzUzF2ppKpnO/view?usp=sharing",
        "https://drive.google.com/file/d/1IpiX7f2ZNUTAgE_f_gjn6YN5FtCpio2p/view?usp=sharing",
        "https://drive.google.com/file/d/19WqMVsbGWY4NFc-gIQY-28PiybL3eQ-v/view?usp=sharing",
        "https://drive.google.com/file/d/1yI0q83SNG-lQWR7x4GsVpUmhurdRWYa4/view?usp=sharing",
        "https://drive.google.com/file/d/1DzArWYgoxup96P1R4T0l0eZ_4677qI0a/view?usp=sharing"
      ],
      "reviews": [
        {
          "type": "tripadvisor",
          "name": "545brycew",
          "text": "Paddle Boarding is a MUST!!!\nMay 2020\nWe went out for industry discount and we were pleasantly surprised at the professionalism of the staff. Everyone helped us out and answered all our questions from billing online to pointers on the paddle board! If you are in Vegas this is a must! Don’t forget to buy their water resistant phone case too!"
        },
        {
          "type": "tripadvisor",
          "name": "Sofica",
          "text": "Our afternoon visit was perfect : we rented paddle boards and the staff was nice, helpful and patient, took the time to explain, etc. The setting is just great, peaceful, beautiful and fun, and it’s so easy to come from the city."
        },
        {
          "type": "tripadvisor",
          "name": "Christine M",
          "text": "Paddleboard Yoga 🧘‍♀️- awesome\nWe booked this for our girlfriends birthday. It was so much fun and challenging. The photographs were awesome 👏🏼"
        },
        {
          "type": "tripadvisor",
          "name": "omaris c",
          "text": "Lake Las Vegas is one of the best hidden gems in Vegas. We came here to paddle board, and the weather was amazing! Being surrounded by beautiful homes and the mountains in the distance made this activity so relaxing!"
        },
        {
          "type": "tripadvisor",
          "name": "karinaderizans",
          "text": "My husband, our friends and I rented paddle boards. The experience, the friendliness of the staff, and the scenery was absolutely awesome! We had so much fun. It was my first time doing it, but the instructor showed me how to feel confident on the board. My husband and I will definitely go back for kayaks, jet packs, and paddle boards again. I highly recommend this place and all of their water sports."
        },
        {
          "type": "yelp",
          "name": "Shawn W.",
          "text": "Any day is a good day when you're paddle boarding but the team at Lake Las Vegas Water Sports brought it up a notch! They were super friendly and extremely efficient. Our group of 5 had a great time and will definitely go back!"
        },
        {
          "type": "yelp",
          "name": "Chelsea L.",
          "text": "I decided to take a venture out of Vegas for a bit and I was pretty hesitant, considering I was by myself. I wanted to try paddle boarding but the weather started to act up and it got windy. Then I quickly changed my mind and went kayaking. It's $36 for two hours, which fair and inexpensive. It gave me plenty of time to relax and learn the basics of kayaking. The staff were very helpful and also, friendly. \nI'd recommend this place for people who want to learn how to paddle board and kayak because you have little space and not much pressure. #kudos"
        },
        {
          "type": "google",
          "name": "Gemma Rose Pangilinan",
          "text": "My friends and I did the nighttime paddle, had lots of fun! Such a great way to soak up the sun and enjoy the water. The instructors and staff were very friendly and helpful. I wish there was more light provided at night as it got really dark paddling back. However, really fun experience!"
        },
        {
          "type": "google",
          "name": "Cody Kaleikini",
          "text": "Tried SUP for the first time and LLVWS made the rental process very easy online. When we got to the lake we were given a brief safety overview as well as quick tips to help my wife and I figure this new sport out. The staff was courteous and patient with us. Definitely looking forward to getting back out on the water ASAP."
        },
        {
          "type": "google",
          "name": "noca su",
          "text": "Spent a beautiful Sunday afternoon paddle boarding, really enjoyed the  serenity & scenic views on the lake.  The staffs there were very helpful and friendly and they have all the gears to have some fun time on the lake!"
        }
      ]
    },
    {
      "name": "Kayak Rentals",
      "caption": "1 or 2 Hours, size Single Kayak or Tandem Kayak",
      "images": [
        "https://drive.google.com/file/d/1ljh0qpy38q4SsGqFWj8Cdr4phh8omxL6/view?usp=sharing ",
        "https://drive.google.com/file/d/1hN_oNi5ZVhhv_1b-yapXNLFrREdXMims/view?usp=sharing",
        "https://drive.google.com/file/d/1CchSoL3HbWMJ6sgi09g_FMDL0b5QSpwi/view?usp=sharing"
      ],
      "reviews": [
        {
          "type": "tripadvisor",
          "name": "MarkGoonan",
          "text": "Tandem kayak for 1hour\nMay 2023\nHighly recommend, the price was very reasonable for 1hour, my wife and myself were attended to straight away by very nice friendly staff who gave us clear and precise instructions, there were safe lockers to use for our belongings and we went straight into the water. You can paddle this huge lake for hours taking in the gorgeous views and there is a beach area you can stop at if you want. The kayaks are very safe and almost impossible to turn over so you don’t need to worry about sinking or tipping over etc. It’s very hot in the summer so make sure you have sun cream on and a drink with you maybe. We really had a great experience and we will be back to do it again."
        },
        {
          "type": "tripadvisor",
          "name": "Bmtravl",
          "text": "This is just a fun time playing around on a calm lake in a kayak with my wife and teenage daughters. It was safe and needed no instruction. No white water and the only thing that will move you other than your own paddle is the wind. Skill level on my daughters was zero and they had a blast. Two hours is just right to get exercise, begin to get bored but still wanting more."
        },
        {
          "type": "tripadvisor",
          "name": "AriDee1991",
          "text": "Great staff, beautiful area. Makes you forget that you’re in Vegas. Kayaks were clean and sturdy. Had a wonderful day with my friends."
        },
        {
          "type": "tripadvisor",
          "name": "ehollendoner",
          "text": "We live here, but rented kayak's for the first time. The staff was super friendly and helpful, and the setup was very easy. If it's your first time here and you are not sure where to go, there is a dock right across from Season's grocery store, where you can sign up for any water sport."
        },
        {
          "type": "tripadvisor",
          "name": "Sandra T",
          "text": "We rented kayaks and a paddle board for an hour starting around 10:15am. Lake was really nice and staff very helpful. Then we did the obstacle course which first run was 11:45 so it gave us time to rest a bit. It was a large group at 11:45 ( we noticed the next hour was about half or less as many people) but it wasn’t over crowded. It took 15 for instructions and putting on life vests then they released everyone to go in any direction you want. The 45 minutes was a perfect time, we were good and tired. If you are just spectating, there are free tables, but a better view is a little bistro but you will need to order something. There is also a little grocery store, snow cone stand and ice cream shop close. It was a beautiful place to visit."
        },
        {
          "type": "yelp",
          "name": "Dominic E.",
          "text": "First time kayaking and it's extremely fun but it's exhausting. If you're a guest at the Westin lake Resort it's so easy It's literally a 2-minute walk from your room to the private lagoon. \nEverything is super easy I scan the QR code at the front desk during check-in. After that everything is booked online you do the waiver online and it's pretty streamlined once you arrive. They have your name you just verify your ID and it's a quick maybe 30 second instruction on how not to sink or flip over. \nSuper fun and exciting and I can't wait to head back home and try it at a local kayaking place where I live. Great exercise and perfect environment."
        },
        {
          "type": "google",
          "name": "Angelica Martinez",
          "text": "Had a wonderful morning renting a kayak at Lake Las Vegas! Although it was a holiday weekend, we got there right around their weekend opening hours of 8 am to beat the crowd and the heat. So glad we did, there was plenty of parking in the garage and the area was fairly quiet. We went into the store signed a waiver and got a kayak without a booking. After paying for your rental you walk over to their docking area and they help you into a kayak. We kayaked around the lake for a little over two hours, even though it was a summer day, getting there early helped us beat the heat. This is a great place if you’re looking for some fun on the water!"
        }
      ]
    },
    {
      "name": "Cable",
      "images": [
        "https://drive.google.com/file/d/1boxbqbcB5QKE_iJa6i0to9mMFn51ML7u/view?usp=sharing "
      ]
    },
    {
      "name": "Swimmable Pontoon",
      "caption": "No License Needed, 3 or 4 Hours",
      "images": []
    },
    {
      "name": "Pink Electric",
      "caption": "No License Needed, 3 or 4 Hours",
      "images": [],
      "reviews": [
        {
          "type": "tripadvisor",
          "name": "beth863",
          "text": "We love going out on our own rental boat out on Lake Las Vegas. It's a must every year which is why we buy the annual pass. Very relaxing!"
        },
        {
          "type": "tripadvisor",
          "name": "brendaparsee",
          "text": "We had a wonderful time two hours me and my family for my husband’s birthday we took the boat out enjoy the boat ride fo\nI want to think though employees that was there they all had a way I had a wonderful time my husband my family had a wonderful time and he was very helpful and they was very knowledgeable about everything he was telling us and we had a great boat ride and a great time so thanks to everybody that was dissipating in our excitement we appreciate yeah"
        },
        {
          "type": "tripadvisor",
          "name": "makennastewart99",
          "text": "From the moment we checked in to getting on the boat everyone was very friendly and informative. Huge thank you to an awesome team for a great experience, this was the best idea for my birthday and I will definetely be recommending Lake Las Vegas Water sports to friends and family for all events! Thank you guys!!"
        },
        {
          "type": "tripadvisor",
          "name": "walke122",
          "text": "My wife and I enjoyed the electric boat cruising around the lake. The temperature of the lake and the scenery around it made the moment even better. I'm looking forward to doing it again."
        },
        {
          "type": "tripadvisor",
          "name": "exysag1969",
          "text": "We rented the electric boat. There were 7 of us. The boat had Bluetooth and we had the music. My Brother drove the boat and the party began. You can bring your own food and liquor++++++ the scene is amazing, so surreal and calm. We did the 90 minute yacht the first time, but this is the way to go. My only complaint was we wish we could’ve rented for 4 hrs instead of 2. Time flies when you’re having fun!!!!!"
        },
        {
          "type": "tripadvisor",
          "name": "donnaoteri",
          "text": "We rented a boat at Lake Las Vegas for the first time….but, it won’t be our last!!! What a great afternoon for adults & kids! The Lake Las Vegas Water Sports experience was first class - boats are clean and well maintained, staff is efficient & professional and check-in seamless. I highly recommend this water activity on beautiful Lake Las Vegas!"
        },
        {
          "type": "yelp",
          "name": "Rachel G.",
          "text": "My family and I thoroughly enjoyed our electric boat ride! Lake Las Vegas Water Sports has an option to rent an electric boat for 2 hours. We booked the boat on their website, and the waivers for each person were emailed to us, making our booking and check in experience very easy and seamless. The staff is extremely friendly and they took their time in explaining anything we needed to know. We will not hesitate to go back on our next trip for more water fun!"
        },
        {
          "type": "yelp",
          "name": "Linda P.",
          "text": "The boat ride was gifted to us for Mother's Day. Our boat rental went very well. The process was smooth and the attendants were very caring and helpful. My husband and I are handicapped and the attendants were very accommodating. The boat was great and the scenery was spectacular! We had an enjoyable time and felt very blessed!"
        }
      ]
    },
    {
      "name": "E-foil",
      "captioin": "1 or 2 Hours",
      "images": []
    },
    {
      "name": "Flyboard",
      "images": [],
      "reviews": [
        {
          "type": "tripadvisor",
          "name": "pmeperformancehorses",
          "text": "What an amazing time. The staff could not have been friendlier. They catered to my 3 year and to my 12 year old. The fly board was awesome and the water park was perfect for the kids. The wakeboarding was so much fun. Josh is awesome and gave my family the best vacation we’ve ever had!!!"
        },
        {
          "type": "tripadvisor",
          "name": "Companion09280784736",
          "text": "Took fiancé to fly board for his birthday\nHe loved it he learned really quickly and enjoyed all his time. We plan to return and do different water sports there. Thank you"
        },
        {
          "type": "tripadvisor",
          "name": "Don H",
          "text": "We were attending a conference in Las Vegas and found Lake Las Vegas Water Sports on line. We wanted to do something different. We went there to try fly boarding for the very first time. It was awesome. Once you got used to it we all had a great time. The person assisting us, Jessie, was a fantastic coach and made sure each of us had an enjoyable time. Highly recommended!!!!"
        },
        {
          "type": "yelp",
          "name": "Kuldip S.",
          "text": "We were just at Lake Las Vegas water sports this place is amazing they have fly boards obstacle course live band lots of other activities in the village of our daughter wanted to go fly Boarding and it was one of the best experiences of her life to be flying on water with Jetske people are very nice check out with them about how many times is the water experience and how much time you spend in the experience on water and how much time is counted towards instructions. \nKyle's hospitality and Logan's service will bring us back."
        },
        {
          "type": "yelp",
          "name": "James E.",
          "text": "First time using their equipments and they go above and beyond trying to customize a good experience for you and your loved ones. They do military discounts for those who served. \nI tried the fly board for the first time and Chris really made me into a pro in those 15 minutes of fame! Very patient and down to earth guy. Also the boats and paddle boards are fun, especially if they have the glow in the dark ones. 5 stars for me and me and my family will be going back definitely."
        },
        {
          "type": "yelp",
          "name": "Sandra P.",
          "text": "I just want to take this time to appreciate Aimee and the whole Intro Deuce Team! I went to the Grand Opening of Lake Las Vegas Watersports the whole experience was amazing and I really enjoyed myself. The food was delicious, the rides were incredible (especially the fly board :):) and overall the event was organized and fun! I am so proud to be apart of such a great group of people and I look forward to many events! Lake Las Vegas Watersports is the new spot to be if you need a get a way with a little adventure :)"
        }
      ]
    }
  ],
  "eventShare": {
    "alsoLike": [
      {
        "name": "Mimosa",
        "alias": "Mimosa Cruise Lake Las Vegas",
        "url": "https://lakelasvegaswatersports.com/mimosa-cruise-lake-las-vegas/",
        "caption": "From: <span>$19.99</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/07/photo_2023-07-06_04-11-13.jpg"
      },
      {
        "name": "Latin Night",
        "alias": "Latin Night Cruise at Lake Las Vegas",
        "url": "https://lakelasvegaswatersports.com/latin-night-cruise-at-lake-las-vegas/",
        "caption": "From: <span>$19.99</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/07/photo_2023-07-10_01-29-13.jpg"
      },
      {
        "name": "Country",
        "alias": "Country Cruise at Lake Las Vegas",
        "url": "https://lakelasvegaswatersports.com/country-cruise-at-lake-las-vegas/",
        "caption": "From: <span>$19.99</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/07/Brown_Vintage_Cowboy_Boot_and_Hat_Photo_Album_Cover__1_.png"
      },
      {
        "name": "Throwback",
        "alias": "Throwback Cruise at Lake Las Vegas",
        "url": "https://lakelasvegaswatersports.com/throwback-cruise-at-lake-las-vegas/",
        "caption": "From: <span>$19.99</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/07/throw-back.jpg"
      },
      {
        "name": "Sangria Sunday",
        "url": "https://lakelasvegaswatersports.com/sip-sail-yacht-cruise/",
        "caption": "From: <span>$19.99</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2023/07/photo_2023-07-06_03-40-32.jpg"
      },
      {
        "name": "Guided Sunset",
        "alias": "Guided Sunset Paddle on Lake Las Vegas",
        "url": "https://lakelasvegaswatersports.com/guided-sunset-paddle-on-lake-las-vegas/",
        "caption": "From: <span>$25.00</span>",
        "src": "https://lakelasvegaswatersports.com/wp-content/uploads/2022/09/sunset-paddle.jpg"
      }
    ],
    "reviews": [
      {
        "type": "yelp",
        "name": "Carrie G.",
        "text": "We love it here! From the booking to the day we arrived, everything went smooth. Everyones friendly and welcoming! They have so much to offer from kayaking, paddle boarding, even brunch at their yacht. Such a fun & great getaway for all ages. We can't wait to go back!"
      },
      {
        "type": "yelp",
        "name": "Shawanna S.",
        "text": "The warm greetings from the staff, the perfect views, great food, good music and one cool captain. This Yacht  Brunch was worth every penny. Most Definitely 5 stars!!"
      },
      {
        "type": "yelp",
        "name": "Debbie G.",
        "text": "I saw a Facebook ad for the 4th of July yacht cruise and thought it looked fun, so I booked it! The online purchase process was super easy and there was a waiver I had to sign as well. I parked in the garage near the Lake Las Vegas shops and then walked over to the dock and was guided to the yacht where the check-in process was very simple and quick. They offered a glass of champagne and once inside, the appetizers were flowing very steadily out of the kitchen. I had multiple helpings because it was so yummy!!  Mostly, I stayed downstairs and enjoyed the cruise around the lake while taking in the view out of the many glass windows, in addition to being comfortable in the well air-conditioned cabin. Once it was time for fireworks, I proceeded upstairs to watch the show! It was great! Music was playing throughout the entire cruise and made it a blast!! Service was impeccable and the staff was so nice and friendly. They were also very attentive and were always cleaning and making sure the guests were well taken care of. I would highly recommend this yacht tour and am hoping they have others which are similar, coming up!!"
      },
      {
        "type": "yelp",
        "name": "D. W.",
        "text": "Had so much fun on the Haunted Cruise on the yacht!  Good mixed crowd and a wide variety of music played by the DJ. Drinks were good and adding on the VIP table and bottle service was so worth it! Something different and fun to do."
      },
      {
        "type": "yelp",
        "name": "Janet S.",
        "text": "REVIEW ON THE YACHT RIDE (includes pros, cons, other notes & if I would do it again) - \nI would give this biz 4 stars - reservation process was easy, no issues, positive interactions with staff.\nI would give the experience 3 stars based on if I thought it was worth it & if I would do it again (see bottom).\n--\nI wanted to do something fun with my family while my sister was visiting for out of state. We decided to do the Sip & Sail on the yacht since some of us in the party wanted to drink.\nPros:\nWe got there early and the person who checked us in was friendly. No negative interactions with staff. \nOur reservation included a champagne toast - it was decent in taste. Other drinks included beer & margaritas (probably the favorite since it wasn't too sweet & you could taste tequila). \nMusic was good (although not really diverse). \nBathrooms were clean. \nWe got to go around the lake and see the awesome mansions in the area. \nCons:\nI'd been to the area before so I knew where to go to check in. I feel like if it were my first time it would have been more confusing since the map they provide in the confirmation email isn't very clear in their directions. \nFloor on the boat looked... a little worn. It looked as if it was lifting. Also, while leaning on the rail on the top deck, it came off. It easily went back on but it was surprising. \nOther notes:\nThere weren't too many people so folks were able to keep some distance. There was no signage or announcement about masks (not judging, just an observation).\nOverall:\nIt was something to do outside of the house on a Sunday. It was cool to see the mansions in the area. Probably won't do it again since I don't think it's really worth the price for a 2nd time. \nIf I could do it again, I would reserve the smaller boat rental (almost $100 cheaper). I would have preferred it to just be my party."
      },
      {
        "type": "yelp",
        "name": "Britney W.",
        "text": "Such a fun girls day! \nMy overall experience with Lake Las Vegas Water Sports was awesome! I booked three tickets for me and my girl friends about 2 weeks in advance and I accidentally booked them for the wrong day. The company was so helpful and got the tickets switched for me!!\nWe arrived early in case we had a hard time locating the office. We parked in the free parking and followed the signs which was super easy to find. It was about a 5 minute walk from the parking garage to the office that is located right on the lake. \nWe got a free mimosa as soon as we boarded the boat and we ordered serval more following. We of course took so many pictures and enjoy the cruise from inside the boat and on the decks. The bartenders, dj, and staff were all awesome! \nI definitely recommend checking this out!"
      },
      {
        "type": "google",
        "name": "Kelly Wilson",
        "text": "Got the pleasure of going on The Yatch cruise out if lake Las Vegas! Be prepared for some epic DJ's this way definitely a fun cruise to go on. Great vibes good people beautiful scenery it was so nice to be out on the water."
      },
      {
        "type": "google",
        "name": "Kenethia L",
        "text": "Wine Wednesday Cruise was really fun! Great music, wine 🍷 and other drinks. Relaxing & met nice people.\nWe'll go again!"
      }
    ],
    "reviewsPaddle": [
      {
        "type": "tripadvisor",
        "name": "545brycew",
        "text": "Paddle Boarding is a MUST!!!\nWe went out for industry discount and we were pleasantly surprised at the professionalism of the staff. Everyone helped us out and answered all our questions from billing online to pointers on the paddle board! If you are in Vegas this is a must! Don’t forget to buy their water resistant phone case too!"
      },
      {
        "type": "tripadvisor",
        "name": "Sofica",
        "text": "Our afternoon visit was perfect : we rented paddle boards and the staff was nice, helpful and patient, took the time to explain, etc. The setting is just great, peaceful, beautiful and fun, and it’s so easy to come from the city."
      },
      {
        "type": "tripadvisor",
        "name": "Christine M",
        "text": "Paddleboard Yoga 🧘‍♀️- awesome\nWe booked this for our girlfriends birthday. It was so much fun and challenging. The photographs were awesome 👏🏼"
      },
      {
        "type": "tripadvisor",
        "name": "omaris c",
        "text": "Lake Las Vegas is one of the best hidden gems in Vegas. We came here to paddle board, and the weather was amazing! Being surrounded by beautiful homes and the mountains in the distance made this activity so relaxing!"
      },
      {
        "type": "tripadvisor",
        "name": "karinaderizans",
        "text": "My husband, our friends and I rented paddle boards. The experience, the friendliness of the staff, and the scenery was absolutely awesome! We had so much fun. It was my first time doing it, but the instructor showed me how to feel confident on the board. My husband and I will definitely go back for kayaks, jet packs, and paddle boards again. I highly recommend this place and all of their water sports."
      },
      {
        "type": "yelp",
        "name": "Shawn W.",
        "text": "Any day is a good day when you're paddle boarding but the team at Lake Las Vegas Water Sports brought it up a notch! They were super friendly and extremely efficient. Our group of 5 had a great time and will definitely go back!"
      },
      {
        "type": "yelp",
        "name": "Chelsea L.",
        "text": "I decided to take a venture out of Vegas for a bit and I was pretty hesitant, considering I was by myself. I wanted to try paddle boarding but the weather started to act up and it got windy. Then I quickly changed my mind and went kayaking. It's $36 for two hours, which fair and inexpensive. It gave me plenty of time to relax and learn the basics of kayaking. The staff were very helpful and also, friendly. \nI'd recommend this place for people who want to learn how to paddle board and kayak because you have little space and not much pressure. #kudos"
      },
      {
        "type": "google",
        "name": "Gemma Rose Pangilinan",
        "text": "My friends and I did the nighttime paddle, had lots of fun! Such a great way to soak up the sun and enjoy the water. The instructors and staff were very friendly and helpful. I wish there was more light provided at night as it got really dark paddling back. However, really fun experience!"
      },
      {
        "type": "google",
        "name": "Cody Kaleikini",
        "text": "Tried SUP for the first time and LLVWS made the rental process very easy online. When we got to the lake we were given a brief safety overview as well as quick tips to help my wife and I figure this new sport out. The staff was courteous and patient with us. Definitely looking forward to getting back out on the water ASAP."
      },
      {
        "type": "google",
        "name": "noca su",
        "text": "Spent a beautiful Sunday afternoon paddle boarding, really enjoyed the  serenity & scenic views on the lake.  The staffs there were very helpful and friendly and they have all the gears to have some fun time on the lake!"
      }
    ],
    "images": [
      "https://drive.google.com/file/d/1VmXXkY7aQQMkF6EfSmBENo4T_tq6iUkG/view?usp=sharing",
      "https://drive.google.com/file/d/1WvZr4ZXFkpxnp-qFvcFs9t7hXzhGrFgS/view?usp=sharing",
      "https://drive.google.com/file/d/155YdEr8w33S-rCqj0mH6pquCvHfV8DWP/view?usp=sharing",
      "https://drive.google.com/file/d/11FIoExLh_KnUJkkJNR92YvVVzmW_syib/view?usp=sharing",
      "https://drive.google.com/file/d/1pTk80rK7jRtDnZ-loCS-rxCSaYYGFZ6Y/view?usp=sharing",
      "https://drive.google.com/file/d/1zo15RcVPo3UaoKNP6X6_bBb1sN_FNvVK/view?usp=sharing",
      "https://drive.google.com/file/d/1rX5Ju9IGpTvewfZp_Y-6oUlE4CxcWAJG/view?usp=sharing",
      "https://drive.google.com/file/d/1QMR-ovgFvvU1y_FgRr62Cyq0fWgBr7rp/view?usp=sharing",
      "https://drive.google.com/file/d/1qGxEjgbMGUTND9iCyqXe5w2i14wpRUme/view?usp=sharing",
      "https://drive.google.com/file/d/1zrJc35KC5uii2Grui4CIommt_1EGHD0V/view?usp=sharing",
      "https://drive.google.com/file/d/1AXA-Q3dQRnk0KCQxJGAfbf1eWhX1hUf2/view?usp=sharing",
      "https://drive.google.com/file/d/1YF31xaF7rbSH4f65fjxNqHsTuBKvdlsJ/view?usp=sharing",
      "https://drive.google.com/file/d/1lYa3AMHEjGgX64gYQNkgjNjdnoTRC6Tf/view?usp=sharing",
      "https://drive.google.com/file/d/1tvVqyxrOcyI_5CgjY5s3Xpa3vY0P9iQg/view?usp=sharing",
      "https://drive.google.com/file/d/1cR_ZGK4HHSI4bwaqs4P76ahNqCz4o7ul/view?usp=sharing",
      "https://drive.google.com/file/d/12KieCMeooo_fAHC6xx7t9BBUGC-7RmcW/view?usp=sharing"
    ]
  },
  "events": [
    {
      "name": "Latin Night"
    },
    {
      "name": "Country"
    },
    {
      "name": "Throwback"
    },
    {
      "name": "Sunset Sessions"
    },
    {
      "name": "Sangria Sunday"
    },
    {
      "name": "Mimosa"
    },
    {
      "name": "Guided Sunset"
    },
    {
      "name": "Neon Paddle"
    },
    {
      "name": "Emo Night"
    },
    {
      "name": "Doggie Paddle"
    },
    {
      "name": "After Dark Neon"
    }
  ]
}